#include "Tinder.h"

int main()
{
	setlocale(LC_ALL, "Russian");
	system("color F0");
	system("chcp 1251");
	
	string gender, name, surname, zodiac_sign, town, gender_f, zodiac_sign_f, town_f, inter;
	vector <string> interest;
	int age, age_f, age_f2, q;

	cout << "Введите ваш пол - ";	cin >> gender;
	cout << "Введите ваше имя - ";	cin >> name;
	cout << "Введите вашу фамилию - ";	cin >> surname;
	cout << "Введите ваш возраст - ";	cin >> age;
	cout << "Введите ваш знак зодиака - ";	cin >> zodiac_sign;
	cout << "Введите ваш город проживания - ";	cin >> town;
	cout << "\nВведите ваши интересы" << endl;
	do
	{
		cin >> inter;
		interest.push_back(inter);
		cout << "Если хотите добавить ещё нажмите 1, нет 0" << endl;
		cin >> q;

	} while (q == 1);
	cout << "\nА теперь введите поисковые данные о вашей второй половинке)\n" << endl;
	cout << "Введите пол - ";	cin >> gender_f;
	cout << "Введите знак зодиака - ";	cin >> zodiac_sign_f;
	cout << "Введите город проживания - ";	cin >> town_f;
	cout << "Введите возраст от - "; cin >> age_f;
	cout << " до ";	cin >> age_f2;
	
	system("cls");

	Tinder tin(gender, name, surname, age, zodiac_sign, town, gender_f, zodiac_sign_f, town_f, age_f, age_f2, interest);
	tin.Print();
	//cout << tin;
	cout << "*********************************************************" << endl;

	vector<Tinder> vec
	{
		
		Tinder("женский", "Коко", "Шанель", 29, "Весы", "Париж", "мужской", "Телец", "Москва", 25, 35, interest = {"спорт", "путешествия", "хоккей"}, 0),
		Tinder("женский", "Дженнифер", "Лопес", 35, "Телец", "Москва", "мужской", "Скорпион", "Токио", 30, 42, interest = {"спорт", "путешествия", "хоккей"}, 0),
		Tinder("женский", "Сальма", "Хайек", 33, "Лев", "Москва", "женщину", "Весы", "Москва", 27, 40, interest = {"спорт", "путешествия", "хоккей"}, 0),
		Tinder("женский", "Меган", "Фокс", 27, "Дева", "Мадрид", "мужской", "Весы", "Москва", 25, 38, interest = {"спорт", "путешествия", "хоккей"}, 0),
		Tinder("женский", "Дженнифер", "Энистон", 29, "Весы", "Париж", "мужской", "Лев", "Париж", 30, 40, interest = {"спорт", "хоккей", "путешествия"},0),
		Tinder("женский", "Скарлетт", "Йоханссон", 30, "Скорпион", "Милан", "мужской", "Рыбы", "Москва", 29, 47, interest = {"спорт", "путешествия", "хоккей"},0),
		Tinder("женский", "Моника", "Беллуччи", 36, "Близнецы", "Москва", "мужской", "Рак", "Москва", 19, 30, interest = {"спорт", "хоккей", "поло"},0),
		Tinder("женский", "Мила", "Кунис", 28, "Весы", "Бангкок", "мужской", "Рак", "Сочи", 20, 30, interest = {"спорт", "путешествия", "хоккей"}, 0),
		Tinder("женский", "Анджелина", "Джоли", 40, "Козерог", "Токио", "мужской", "Овен", "Москва", 29, 39, interest = {"спорт", "путешествия", "хоккей"}, 0),
		Tinder("женский", "Пенелопа", "Крус", 43, "Близнецы", "Сочи", "мужской", "Телец", "Токио", 31, 47, interest = {"спорт", "путешествия", "хоккей"}, 0),
	};

	for (int i = 0; i < vec.size(); i++)
	{
		vec[i].Print();
		cout << "*********************************************************" << endl;
	}

	tin.Run(tin, vec);
}